In [65]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {"a" : [4 ,5, 6,6,np.nan],
    "b" : [7, 8, np.nan, 9,9],
    "c" : [10, 11, 12,12, 12]},
    index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e',4)],
        names=['n','v']))
df

       a    b   c
n v
d 1  4.0  7.0  10
  2  5.0  8.0  11
e 2  6.0  NaN  12
  3  6.0  9.0  12
  4  NaN  9.0  12

In [66]:
df[df.a>7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [67]:
df[df.a<7]

       a    b   c
n v
d 1  4.0  7.0  10
  2  5.0  8.0  11
e 2  6.0  NaN  12
  3  6.0  9.0  12

In [68]:
df[df.b>7]

       a    b   c
n v
d 2  5.0  8.0  11
e 3  6.0  9.0  12
  4  NaN  9.0  12

In [69]:
df.b>7

n  v
d  1    False
   2     True
e  2    False
   3     True
   4     True
Name: b, dtype: bool

In [70]:
df = df.drop_duplicates()
df

       a    b   c
n v
d 1  4.0  7.0  10
  2  5.0  8.0  11
e 2  6.0  NaN  12
  3  6.0  9.0  12
  4  NaN  9.0  12

## Logic in Python (and Pandas)

In [71]:
df["a"] != 7

n  v
d  1    True
   2    True
e  2    True
   3    True
   4    True
Name: a, dtype: bool

In [72]:
df[df["b"] != 7]

       a    b   c
n v
d 2  5.0  8.0  11
e 2  6.0  NaN  12
  3  6.0  9.0  12
  4  NaN  9.0  12

In [73]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
   4    False
Name: a, dtype: bool

In [74]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False  False
  4   True  False  False

In [77]:
df['a'].isnull().sum()

1

In [78]:
df['a'].notnull().sum()

4

In [79]:
df.notnull().sum()

a    4
b    4
c    5
dtype: int64

In [80]:
~df.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

## df.sample(frac=0.5), df.sample(n=10), df.nlargest, df.nsmallest

In [92]:
df

       a    b   c
n v
d 1  4.0  7.0  10
  2  5.0  8.0  11
e 2  6.0  NaN  12
  3  6.0  9.0  12
  4  NaN  9.0  12

In [95]:
df.sample(frac=0.5)    # random collection by row fraction

       a    b   c
n v
d 1  4.0  7.0  10
e 2  6.0  NaN  12

In [110]:
df.sample(n=2)        # random collection by number of rows

       a    b   c
n v
d 2  5.0  8.0  11
e 2  6.0  NaN  12

In [111]:
df.iloc[2:4]

       a    b   c
n v
e 2  6.0  NaN  12
  3  6.0  9.0  12

In [112]:
df.nlargest(2,"c")

       a    b   c
n v
e 2  6.0  NaN  12
  3  6.0  9.0  12

In [113]:
df.nsmallest(3,"a")

       a    b   c
n v
d 1  4.0  7.0  10
  2  5.0  8.0  11
e 2  6.0  NaN  12